## OpenTofu plan
```text
module.test_endpoint.time_sleep.wait: Refreshing state... [id=2026-01-17T18:25:33Z]
time_sleep.wait_for_url_permission: Refreshing state... [id=2026-01-17T18:25:03Z]
module.function.data.archive_file.source_code: Reading...
module.function.data.archive_file.source_code: Read complete after 0s [id=6840ba70036e8f0c1dc8b4e5deeda007c63d9a31]
module.function.data.aws_iam_policy_document.policy: Reading...
aws_lambda_permission.allow_public_invoke_url: Refreshing state... [id=AllowPublicInvokeFunctionUrl]
module.function.data.aws_iam_policy_document.allow_logging: Reading...
module.function.data.aws_iam_policy_document.allow_logging: Read complete after 0s [id=16712114]
module.function.data.aws_iam_policy_document.policy: Read complete after 0s [id=2690255455]
module.function.aws_iam_role.lambda: Refreshing state... [id=lambda-sample-debug-manual]
module.function.aws_iam_role_policy.allow_logging: Refreshing state... [id=lambda-sample-debug-manual:lambda-sample-debug-manual-allow-logging]
module.function.aws_lambda_function.function: Refreshing state... [id=lambda-sample-debug-manual]
module.function.aws_lambda_function_url.url[0]: Refreshing state... [id=lambda-sample-debug-manual]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # aws_lambda_permission.allow_public_invoke_url will be destroyed
  # (because aws_lambda_permission.allow_public_invoke_url is not in configuration)
  - resource "aws_lambda_permission" "allow_public_invoke_url" {
      - action                 = "lambda:InvokeFunctionUrl" -> null
      - function_name          = "lambda-sample-debug-manual" -> null
      - function_url_auth_type = "NONE" -> null
      - id                     = "AllowPublicInvokeFunctionUrl" -> null
      - principal              = "*" -> null
      - statement_id           = "AllowPublicInvokeFunctionUrl" -> null
    }

  # time_sleep.wait_for_url_permission will be destroyed
  # (because time_sleep.wait_for_url_permission is not in configuration)
  - resource "time_sleep" "wait_for_url_permission" {
      - create_duration = "20s" -> null
      - id              = "2026-01-17T18:25:03Z" -> null
    }

  # module.function.aws_iam_role.lambda must be replaced
-/+ resource "aws_iam_role" "lambda" {
      ~ arn                   = "arn:aws:iam::968196829199:role/lambda-sample-debug-manual" -> (known after apply)
      ~ create_date           = "2026-01-17T18:24:26Z" -> (known after apply)
      ~ id                    = "lambda-sample-debug-manual" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "lambda-sample-debug-manual" -> "lambda-sample-pr-1" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA6C3IHGAH2BUWODYXG" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # module.function.aws_iam_role_policy.allow_logging must be replaced
-/+ resource "aws_iam_role_policy" "allow_logging" {
      ~ id          = "lambda-sample-debug-manual:lambda-sample-debug-manual-allow-logging" -> (known after apply)
      ~ name        = "lambda-sample-debug-manual-allow-logging" -> "lambda-sample-pr-1-allow-logging" # forces replacement
      + name_prefix = (known after apply)
      ~ role        = "lambda-sample-debug-manual" -> "lambda-sample-pr-1" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.function.aws_lambda_function.function must be replaced
-/+ resource "aws_lambda_function" "function" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-2:968196829199:function:lambda-sample-debug-manual" -> (known after apply)
      ~ code_sha256                    = "kGP+RJKkMGZpXQb48efT8ZsuHeStVPUvgTORLmulBeI=" -> (known after apply)
      ~ filename                       = ".terraform/modules/function/modules/lambda/lambda-sample-debug-manual.zip" -> ".terraform/modules/function/modules/lambda/lambda-sample-pr-1.zip"
      ~ function_name                  = "lambda-sample-debug-manual" -> "lambda-sample-pr-1" # forces replacement
      ~ id                             = "lambda-sample-debug-manual" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:968196829199:function:lambda-sample-debug-manual/invocations" -> (known after apply)
      ~ last_modified                  = "2026-01-17T18:58:31.845+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:968196829199:function:lambda-sample-debug-manual:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:968196829199:function:lambda-sample-debug-manual:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::968196829199:role/lambda-sample-debug-manual" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "kGP+RJKkMGZpXQb48efT8ZsuHeStVPUvgTORLmulBeI=" -> "3ZCIyw/Dl6SK4QSnJUiC//dbXmMeyZNrI9dnS6N4Q+I="
      ~ source_code_size               = 238 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ ephemeral_storage {
          + architectures                      = (known after apply)
          + arn                                = (known after apply)
          + code_sha256                        = (known after apply)
          + code_signing_config_arn            = (known after apply)
          + description                        = (known after apply)
          + filename                           = (known after apply)
          + function_name                      = (known after apply)
          + handler                            = (known after apply)
          + id                                 = (known after apply)
          + image_uri                          = (known after apply)
          + invoke_arn                         = (known after apply)
          + kms_key_arn                        = (known after apply)
          + last_modified                      = (known after apply)
          + layers                             = (known after apply)
          + memory_size                        = (known after apply)
          + package_type                       = (known after apply)
          + publish                            = (known after apply)
          + qualified_arn                      = (known after apply)
          + qualified_invoke_arn               = (known after apply)
          + replace_security_groups_on_destroy = (known after apply)
          + replacement_security_group_ids     = (known after apply)
          + reserved_concurrent_executions     = (known after apply)
          + role                               = (known after apply)
          + runtime                            = (known after apply)
          + s3_bucket                          = (known after apply)
          + s3_key                             = (known after apply)
          + s3_object_version                  = (known after apply)
          + signing_job_arn                    = (known after apply)
          + signing_profile_version_arn        = (known after apply)
          + skip_destroy                       = (known after apply)
          + source_code_hash                   = (known after apply)
          + source_code_size                   = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + timeout                            = (known after apply)
          + version                            = (known after apply)
        } -> (known after apply)

      ~ logging_config {
          + architectures                      = (known after apply)
          + arn                                = (known after apply)
          + code_sha256                        = (known after apply)
          + code_signing_config_arn            = (known after apply)
          + description                        = (known after apply)
          + filename                           = (known after apply)
          + function_name                      = (known after apply)
          + handler                            = (known after apply)
          + id                                 = (known after apply)
          + image_uri                          = (known after apply)
          + invoke_arn                         = (known after apply)
          + kms_key_arn                        = (known after apply)
          + last_modified                      = (known after apply)
          + layers                             = (known after apply)
          + memory_size                        = (known after apply)
          + package_type                       = (known after apply)
          + publish                            = (known after apply)
          + qualified_arn                      = (known after apply)
          + qualified_invoke_arn               = (known after apply)
          + replace_security_groups_on_destroy = (known after apply)
          + replacement_security_group_ids     = (known after apply)
          + reserved_concurrent_executions     = (known after apply)
          + role                               = (known after apply)
          + runtime                            = (known after apply)
          + s3_bucket                          = (known after apply)
          + s3_key                             = (known after apply)
          + s3_object_version                  = (known after apply)
          + signing_job_arn                    = (known after apply)
          + signing_profile_version_arn        = (known after apply)
          + skip_destroy                       = (known after apply)
          + source_code_hash                   = (known after apply)
          + source_code_size                   = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + timeout                            = (known after apply)
          + version                            = (known after apply)
        } -> (known after apply)

      ~ tracing_config {
          + architectures                      = (known after apply)
          + arn                                = (known after apply)
          + code_sha256                        = (known after apply)
          + code_signing_config_arn            = (known after apply)
          + description                        = (known after apply)
          + filename                           = (known after apply)
          + function_name                      = (known after apply)
          + handler                            = (known after apply)
          + id                                 = (known after apply)
          + image_uri                          = (known after apply)
          + invoke_arn                         = (known after apply)
          + kms_key_arn                        = (known after apply)
          + last_modified                      = (known after apply)
          + layers                             = (known after apply)
          + memory_size                        = (known after apply)
          + package_type                       = (known after apply)
          + publish                            = (known after apply)
          + qualified_arn                      = (known after apply)
          + qualified_invoke_arn               = (known after apply)
          + replace_security_groups_on_destroy = (known after apply)
          + replacement_security_group_ids     = (known after apply)
          + reserved_concurrent_executions     = (known after apply)
          + role                               = (known after apply)
          + runtime                            = (known after apply)
          + s3_bucket                          = (known after apply)
          + s3_key                             = (known after apply)
          + s3_object_version                  = (known after apply)
          + signing_job_arn                    = (known after apply)
          + signing_profile_version_arn        = (known after apply)
          + skip_destroy                       = (known after apply)
          + source_code_hash                   = (known after apply)
          + source_code_size                   = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + timeout                            = (known after apply)
          + version                            = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.function.aws_lambda_function_url.url[0] must be replaced
-/+ resource "aws_lambda_function_url" "url" {
      ~ function_arn       = "arn:aws:lambda:us-east-2:968196829199:function:lambda-sample-debug-manual" -> (known after apply)
      ~ function_name      = "lambda-sample-debug-manual" -> "lambda-sample-pr-1" # forces replacement
      ~ function_url       = "https://njv7lpa5x75a2ajujdwhyae63q0niylv.lambda-url.us-east-2.on.aws/" -> (known after apply)
      ~ id                 = "lambda-sample-debug-manual" -> (known after apply)
      ~ url_id             = "njv7lpa5x75a2ajujdwhyae63q0niylv" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.test_endpoint.data.http.test_endpoint will be read during apply
  # (config refers to values not yet known)
 <= data "http" "test_endpoint" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + method               = "GET"
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = (known after apply)
    }

Plan: 4 to add, 0 to change, 6 to destroy.

Changes to Outputs:
  ~ api_endpoint  = "https://njv7lpa5x75a2ajujdwhyae63q0niylv.lambda-url.us-east-2.on.aws/" -> (known after apply)
  + function_name = "lambda-sample-pr-1"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```